Repository: for-nobody/input-flow
Catalog: apps/settings-winui/InputFlow.Settings/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Capture_CompleteTitle
source: Capture complete
zh_cn: 录制完成

# Capture_MouseCompleteFormat
source: Selected the {0} mouse button.
zh_cn: 已选择鼠标{0}。

# Capture_KeyCompleteFormat
source: Captured {0}; logical identity is used by default.
zh_cn: 已记录 {0}；默认使用 logical identity。

# Capture_TypeMismatchMessage
source: The captured input type does not fit this field. Capture again.
zh_cn: 录制到的输入类型不适合当前字段，请重新录制。

# Capture_IncompleteTitle
source: Capture incomplete
zh_cn: 录制未完成

# Capture_CancellingTitle
source: Cancelling capture
zh_cn: 正在取消录制

# Capture_CancellingPendingMessage
source: The capture request is starting. It will be cancelled as soon as a session ID is available; no input will be written meanwhile.
zh_cn: 录制请求正在启动；取得 session ID 后会立即取消，期间不会写入任何字段。

# Capture_CancelledMessage
source: The cancellation key was not written to the draft.
zh_cn: 取消键不会写入草稿。

# Capture_CancelIntentTitle
source: Cancellation request applied
zh_cn: 取消意图已生效

# Capture_CancelUnconfirmedFormat
source: The current field was invalidated and will not accept capture results. The Agent did not confirm cancellation: {0}
zh_cn: 当前字段已失效，不会写入录制结果；Agent 未确认取消：{0}

# Capture_TimedOutMessage
source: Input capture timed out.
zh_cn: 输入录制已超时。

# Capture_AgentShutdownMessage
source: The Agent exited before capture completed.
zh_cn: Agent 已退出，录制未完成。

# Capture_EventStreamLostMessage
source: The event connection was lost, so the capture result cannot be determined. Capture again.
zh_cn: 事件连接已断开，无法确定录制结果，请重新录制。

# CaptureBar_Title
source: Capturing input
zh_cn: 正在录制输入

# Emergency_InvalidTitle
source: Invalid emergency key
zh_cn: 紧急键无效

# Emergency_LogicalRequiredMessage
source: The emergency bypass key must use logical identity.
zh_cn: 紧急旁路键必须使用 logical identity。

# Draft_UpdatedTitle
source: Draft updated
zh_cn: 已写入草稿

# Emergency_DraftUpdatedMessage
source: The emergency bypass key is not saved yet. The Agent checks rule conflicts during save.
zh_cn: 紧急旁路键尚未保存；Agent 会在保存时检查规则冲突。

# RuleGroup_All
source: All rules
zh_cn: 全部规则

# RuleGroup_Symbols
source: Symbol keys
zh_cn: 符号键

# RuleGroup_Digits
source: Digits
zh_cn: 数字

# RuleGroup_Numpad
source: Numpad
zh_cn: 小键盘

# RuleGroup_Letters
source: Letters
zh_cn: 字母

# RuleGroup_Space
source: Space
zh_cn: 空格

# RuleRow_ToggleAutomationNameFormat
source: {0} enabled state
zh_cn: {0} 启用状态

# RuleRow_EditAutomationNameFormat
source: Edit {0}
zh_cn: 编辑 {0}

# RuleRow_DeleteAutomationNameFormat
source: Delete {0}
zh_cn: 删除 {0}

# RuleRow_AutomationNameFormat
source: Rule {0}, {1}, {2}
zh_cn: 规则 {0}，{1}，{2}

# RuleRow_KeyMouseTriggerFormat
source: {0} + {1} mouse button
zh_cn: {0} + 鼠标{1}

# RuleRow_HoldTriggerFormat
source: Hold {0} for {1} ms
zh_cn: 长按 {0} {1} ms

# RuleRow_HoldMouseTriggerFormat
source: Hold {0} for {1} ms + {2} mouse button
zh_cn: 长按 {0} {1} ms + 鼠标{2}

# RuleRow_MouseDirectionTriggerFormat
source: Hold {0} + mouse {1} ≥{2}px / {3}ms / off-axis ≤{4}px
zh_cn: 按住 {0} + 鼠标{1} ≥{2}px / {3}ms / 偏轴≤{4}px

# Error_Timeout
source: The Agent did not respond before the timeout.
zh_cn: Agent 未在超时前响应。

# Error_AccessDenied
source: Settings cannot connect to the Agent. Confirm that both run in the same user session.
zh_cn: Settings 无权连接 Agent。请确认两者位于同一用户会话。

# Error_UnsupportedProtocol
source: The Settings and Agent protocol versions are incompatible.
zh_cn: Settings 与 Agent 的协议版本不兼容。

# Error_UnsupportedSchema
source: The Settings and Agent configuration Schema versions are incompatible.
zh_cn: Settings 与 Agent 的配置 Schema 版本不兼容。

# Error_ProtocolFormat
source: The Agent rejected the request with protocol error {0}.
zh_cn: Agent 以协议错误 {0} 拒绝了请求。

# Error_ConnectionInterrupted
source: The Agent connection was interrupted.
zh_cn: Agent 连接已中断。

# Error_InvalidState
source: The operation is not available in the current Agent state.
zh_cn: 当前 Agent 状态不允许执行此操作。

# Error_InvalidAgentData
source: The Agent returned data that Settings could not read.
zh_cn: Agent 返回了 Settings 无法读取的数据。

# Error_UnexpectedFormat
source: An unexpected {0} error occurred.
zh_cn: 发生意外的 {0} 错误。

# KeyPicker_PhysicalScanCodeInvalid
source: Physical scan code must be from 1 through 65535.
zh_cn: Physical scan code 必须在 1–65535 之间。

# KeyPicker_LogicalKeyRequired
source: Select a logical key.
zh_cn: 请选择逻辑键。

# KeyPicker_IdentityFormat
source: Display: {0} Identity: {1}
zh_cn: 显示：{0} Identity：{1}
